---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult
source: html/e2792594-c085-0582-9ff8-3eb8ea726bdc.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult

Possible results from invoking the DesignToFabricationConverter.

## Syntax (C#)
```csharp
public enum DesignToFabricationConverterResult
```